Documents/АР_РаспределениеДолейСобственников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР_РаспределениеДолейСобственников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АР_СобственникиОбъектовАрендыСпр</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаСобственник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Собственники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыАренды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расшифровка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АР_СобственникиОбъектовАрендыСпр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_СобственникиОбъектовАрендыСпр</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АгентскаяСхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСобственника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/АР_РаспределениеДолейСобственников/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	РаспределитьНаСервере();
КонецПроцедуры

Процедура РаспределитьНаСервере()
	//очистим
	НаборЗаписей = РегистрыСведений.АР_СобственникиОбъектовАрендыСпр.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка); 
	НаборЗаписей.Записать(); 
	
	Для Каждого СтрОбъектыАренды Из ОбъектыАренды Цикл
		Для Каждого СтрСобственники Из Собственники Цикл
			ЗаписатьСобственникаРегСпр(СтрОбъектыАренды.ОбъектАренды, СтрСобственники.Контрагент, СтрСобственники.ДоговорКонтрагента, Дата, СтрСобственники.Доля, НаборЗаписей);
		КонецЦикла;
	КонецЦикла;	
	
	НаборЗаписей.Записать();// + NAI Becar Конюшок С.Н. от 24.08.2017 15:38 
	
КонецПроцедуры

Процедура ЗаписатьСобственникаРегСпр(ОбъектАренды, Собственник, Договор, Дата, ДоляСобственника, НаборЗаписей)
	
	// + NAI Becar Конюшок С.Н. от 24.08.2017 15:37 wtf?
	////НаборЗаписей = РегистрыСведений.АР_СобственникиОбъектовАрендыСпр.СоздатьНаборЗаписей();
	//////НаборЗаписей.Отбор.Период.Установить(Дата);
	//////НаборЗаписей.Отбор.ОбъектАренды.Установить(ОбъектАренды);
	//////НаборЗаписей.Отбор.Контрагент.Установить(Собственник);
	//////НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(Договор);
	////
	////НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	////
	////НаборЗаписей.Прочитать();
	// - NAI Becar Конюшок С.Н. 
	
	//Если НаборЗаписей.Количество() = 0 Тогда
	    НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Регистратор = Ссылка; 
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.ОбъектАренды = ОбъектАренды;
		//НоваяЗапись.Контрагент = Собственник;
		//НоваяЗапись.ДоговорКонтрагента = Договор;
	//ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
	//    НоваяЗапись = НаборЗаписей[0];
	//КонецЕсли;
	
	НоваяЗапись.Период = Дата;
	НоваяЗапись.ОбъектАренды = ОбъектАренды;
	НоваяЗапись.Контрагент = Собственник;
	НоваяЗапись.ДоговорКонтрагента = Договор;
	НоваяЗапись.ДоляСобственника = ДоляСобственника;
	
	//НаборЗаписей.Записать(); // + NAI Becar Конюшок С.Н. от 24.08.2017 15:37 wtf?
	
	////////////////////////////////////////
	
	//Запись = РегистрыСведений.АР_СобственникиОбъектовАрендыСпр.СоздатьМенеджерЗаписи();
	//Запрос = Новый Запрос;
	//Запрос.Текст = ""ВЫБРАТЬ
	//                |	АР_СобственникиОбъектовАрендыСпр.Период,
	//                |	АР_СобственникиОбъектовАрендыСпр.Регистратор,
	//                |	АР_СобственникиОбъектовАрендыСпр.НомерСтроки,
	//                |	АР_СобственникиОбъектовАрендыСпр.Активность,
	//                |	АР_СобственникиОбъектовАрендыСпр.ОбъектАренды,
	//                |	АР_СобственникиОбъектовАрендыСпр.Контрагент,
	//                |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента,
	//                |	АР_СобственникиОбъектовАрендыСпр.АгентскаяСхема,
	//                |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника
	//                |ИЗ
	//                |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
	//                |ГДЕ
	//                |	АР_СобственникиОбъектовАрендыСпр.Регистратор = &Регистратор
	//                |	И АР_СобственникиОбъектовАрендыСпр.ОбъектАренды = &ОбъектАренды
	//                |	И АР_СобственникиОбъектовАрендыСпр.Контрагент = &Контрагент
	//                |	И АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента = &ДоговорКонтрагента";
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//Пока Выборка.Следующий() Цикл

	//// Установить ключевые поля менеджера записи
	//Запись.Период = Выборка.Период;
	//Запись.Покупатель = Выборка.Покупатель;
	//Запись.Номенклатура = Выборка.Номенклатура;

	//// Прочитать запись из базы данных
	//Запись.Прочитать();

	//// Убедиться, что запись все еще есть в базе данных
	//Если Запись.Выбран() Тогда

	//  // Переопределить покупателя
	//  Запись.Покупатель = ВыделенныйПокупатель; 
	//  // Установить новую цену
	//  Запись.Цена = Выборка.Цена * 1.2;
	//  // Записать модифицированную запись в базу данных
	//  Запись.Записать();
	//КонецЕсли;
	
	//КонецЦикла;

	
КонецПроцедуры
